Repository: naveeneppalapally/TrustBridge
Catalog: lib/l10n/app_*.arb
Languages: hi

# dashboardTitle
source: Dashboard
hi: डैशबोर्ड

# childrenTitle
source: Children
hi: बच्चे

# settingsTitle
source: Settings
hi: सेटिंग्स

# protectionTitle
source: Protection
hi: सुरक्षा

# addChildButton
source: Add Child
hi: बच्चा जोड़ें

# editButton
source: Edit
hi: संपादित करें

# deleteButton
source: Delete
hi: हटाएं

# saveButton
source: Save
hi: सहेजें

# retryButton
source: Retry
hi: फिर से प्रयास करें

# cancelButton
source: Cancel
hi: रद्द करें

# continueButton
source: Continue
hi: जारी रखें

# welcomeMessage
source: Welcome to TrustBridge
hi: TrustBridge में आपका स्वागत है

# welcomeSubtitle
source: Set healthy digital boundaries for your family
hi: अपने परिवार के लिए स्वस्थ डिजिटल सीमाएं तय करें

# childNicknameLabel
source: Nickname
hi: उपनाम

# childAgeBandLabel
source: Age Band
hi: आयु वर्ग

# youngAgeBand
source: 6-9 years
hi: 6-9 साल

# middleAgeBand
source: 10-13 years
hi: 10-13 साल

# teenAgeBand
source: 14-17 years
hi: 14-17 साल

# vpnProtectionTitle
source: VPN Protection
hi: VPN सुरक्षा

# enableProtectionButton
source: Enable Protection
hi: सुरक्षा चालू करें

# disableProtectionButton
source: Disable Protection
hi: सुरक्षा बंद करें

# protectionActiveMessage
source: Protection running
hi: सुरक्षा चालू है

# protectionInactiveMessage
source: Ready to start
hi: सुरक्षा बंद है

# requestAccessTitle
source: Request Access
hi: एक्सेस अनुरोध

# requestAccessButton
source: Ask for Access
hi: एक्सेस मांगें

# appOrSiteLabel
source: App or website
hi: एप या वेबसाइट

# durationLabel
source: Duration
hi: अवधि

# reasonLabel
source: Reason (optional)
hi: कारण (वैकल्पिक)

# submitRequestButton
source: Send Request
hi: अनुरोध भेजें

# pendingRequestsTitle
source: Pending Requests
hi: लंबित अनुरोध

# historyTitle
source: History
hi: इतिहास

# approveButton
source: Approve
hi: स्वीकृत करें

# denyButton
source: Deny
hi: अस्वीकार करें

# notificationSettingsTitle
source: Notifications
hi: सूचनाएं

# notificationEnabledMessage
source: Enabled
hi: चालू

# notificationDisabledMessage
source: Tap to enable
hi: चालू करने के लिए टैप करें

# languageSettingsTitle
source: Language
hi: भाषा

# languageHindi
source: Hindi (हिंदी)
hi: हिंदी

# feedbackTitle
source: Feedback
hi: प्रतिक्रिया

# analyticsTitle
source: Analytics
hi: विश्लेषण

# noChildrenMessage
source: No children yet
hi: अभी तक कोई बच्चा नहीं जोड़ा गया

# noRequestsMessage
source: No pending requests
hi: कोई लंबित अनुरोध नहीं

# errorGeneric
source: Something went wrong
hi: कुछ गलत हो गया

# errorNetwork
source: Network error. Please try again.
hi: नेटवर्क त्रुटि। कृपया फिर से प्रयास करें।

# errorPermission
source: Permission denied
hi: अनुमति अस्वीकृत

# durationFifteenMin
source: 15 minutes
hi: 15 मिनट

# durationThirtyMin
source: 30 minutes
hi: 30 मिनट

# durationOneHour
source: 1 hour
hi: 1 घंटा

# durationUntilEnd
source: Until schedule ends
hi: शेड्यूल समाप्त होने तक

# statusPending
source: Pending
hi: लंबित

# statusApproved
source: Approved
hi: स्वीकृत

# statusDenied
source: Denied
hi: अस्वीकृत

# statusExpired
source: Expired
hi: समाप्त

# notLoggedInMessage
source: Not logged in
hi: लॉगिन नहीं है

# accessRequestsTitle
source: Access Requests
hi: एक्सेस अनुरोध

# pendingTabTitle
source: Pending
hi: लंबित

# allCaughtUpTitle
source: All caught up!
hi: सब अपडेट है!

# noPendingRequestsSubtitle
source: No pending requests from your children.
hi: आपके बच्चों से कोई लंबित अनुरोध नहीं है।

# noHistoryYetTitle
source: No history yet
hi: अभी तक कोई इतिहास नहीं

# noHistoryYetSubtitle
source: Approved and denied requests will appear here.
hi: स्वीकृत और अस्वीकृत अनुरोध यहां दिखेंगे।

# wantsAccessToLabel
source: Wants access to
hi: एक्सेस चाहता/चाहती है

# addReplyButton
source: Add reply
hi: जवाब जोड़ें

# cancelReplyButton
source: Cancel reply
hi: जवाब रद्द करें

# requestApprovedMessage
source: Request approved.
hi: अनुरोध स्वीकृत कर दिया गया।

# requestDeniedMessage
source: Request denied.
hi: अनुरोध अस्वीकृत कर दिया गया।

# requestReplyHint
source: Message to {childName}... (optional)
hi: {childName} के लिए संदेश... (वैकल्पिक)

# errorWithValue
source: Error: {value}
hi: त्रुटि: {value}

source: just now
hi: अभी

# minutesAgo
source: {count}m ago
hi: {count}मि पहले

# hoursAgo
source: {count}h ago
hi: {count}घं पहले

# daysAgo
source: {count}d ago
hi: {count}दिन पहले

# ageLabel
source: Age: {ageBand}
hi: उम्र: {ageBand}

# pausedLabel
source: Paused
hi: रोका गया

# categoriesBlockedCount
source: {count} categories blocked
hi: {count} श्रेणियां ब्लॉक

# schedulesCount
source: {count} schedules
hi: {count} शेड्यूल

# managedProfilesLabel
source: MANAGED PROFILES
hi: प्रोफाइल्स

# blockedCategoriesLabel
source: BLOCKED CATEGORIES
hi: ब्लॉक श्रेणियां

# schedulesLabel
source: SCHEDULES
hi: शेड्यूल

# addChildTitle
source: Add Child
hi: बच्चा जोड़ें

# ageBandGuideTooltip
source: Age Band Guide
hi: आयु वर्ग गाइड

# addChildHeadline
source: Add a new child profile
hi: नया बच्चा प्रोफाइल जोड़ें

# addChildSubtitle
source: We will set up age-appropriate content filters
hi: हम आयु-उपयुक्त कंटेंट फिल्टर लगाएंगे

# nicknameHint
source: e.g., Alex, Sam, Priya
hi: उदाहरण: Alex, Sam, Priya

# nicknameHelper
source: What should we call this child?
hi: हम इस बच्चे को क्या बुलाएं?

# enterNicknameError
source: Please enter a nickname
hi: कृपया एक उपनाम दर्ज करें

# nicknameMinError
source: Nickname must be at least 2 characters
hi: उपनाम कम से कम 2 अक्षर का होना चाहिए

# nicknameMaxError
source: Nickname must be less than 20 characters
hi: उपनाम 20 अक्षर से कम होना चाहिए

# ageGroupLabel
source: Age Group
hi: आयु समूह

# whichAgeBandLabel
source: Which age band?
hi: कौन सा आयु वर्ग?

# ageYoungSubtitle
source: Young children - strictest filters
hi: छोटे बच्चे - सबसे कठोर फिल्टर

# ageMiddleSubtitle
source: Middle schoolers - moderate filters
hi: मिडिल स्कूल - मध्यम फिल्टर

# ageTeenSubtitle
source: Teenagers - balanced approach
hi: किशोर - संतुलित दृष्टिकोण

# whatWillBeBlockedLabel
source: What will be blocked?
hi: क्या ब्लॉक होगा?

# contentLabel
source: Content:
hi: कंटेंट:

# timeRestrictionsLabel
source: Time restrictions:
hi: समय प्रतिबंध:

# safeSearchEnabledLabel
source: Safe search enabled
hi: सेफ सर्च चालू

# customizeLaterHint
source: You can customize these settings later
hi: आप इन सेटिंग्स को बाद में बदल सकते हैं

# childAddedSuccessMessage
source: {childName} added successfully!
hi: {childName} सफलतापूर्वक जोड़ा गया!

# failedToAddChildMessage
source: Failed to add child: {error}
hi: बच्चा जोड़ने में विफल: {error}

# vpnProtectionEngineTitle
source: VPN Protection Engine
hi: VPN सुरक्षा इंजिन

# dnsFilteringFoundationTitle
source: DNS Filtering Foundation
hi: DNS फिल्टरिंग फाउंडेशन

# vpnIntroSubtitle
source: Enable Android VPN permission to run TrustBridge network protection.
hi: TrustBridge नेटवर्क सुरक्षा चलाने के लिए Android VPN अनुमति चालू करें।

# currentStatusLabel
source: Current Status
hi: वर्तमान स्थिति

# refreshStatusTooltip
source: Refresh status
hi: स्थिति रिफ्रेश करें

# policySyncTitle
source: Policy Sync
hi: पॉलिसी सिंक

# syncNowButton
source: Sync Now
hi: अभी सिंक करें

# syncingButton
source: Syncing...
hi: सिंक हो रहा है...

# notYetSyncedMessage
source: Not yet synced.
hi: अभी तक सिंक नहीं हुआ।

# syncFailedMessage
source: Sync failed: {error}
hi: सिंक विफल: {error}

# childrenSyncedLabel
source: Children synced
hi: सिंक हुए बच्चे

# categoriesBlockedMetricLabel
source: Categories blocked
hi: ब्लॉक श्रेणियां

# domainsBlockedMetricLabel
source: Domains blocked
hi: ब्लॉक डोमेन

# lastSyncedLabel
source: Last synced
hi: अंतिम सिंक

# processingLabel
source: Processing...
hi: प्रोसेस हो रहा है...

# notAvailableLabel
source: Not Available
hi: उपलब्ध नहीं

# syncPolicyRulesButton
source: Sync Policy Rules
hi: पॉलिसी रूल सिंक करें

# restartVpnServiceButton
source: Restart VPN Service
hi: VPN सेवा पुनः चालू करें

# restartingButton
source: Restarting...
hi: पुनः चालू हो रहा है...

# viewDnsQueryLogsButton
source: View DNS Query Logs
hi: DNS क्वेरी लॉग देखें

# nextDnsIntegrationButton
source: NextDNS Integration
hi: NextDNS इंटीग्रेशन

# domainPolicyTesterButton
source: Domain Policy Tester
hi: डोमेन पॉलिसी टेस्टर

# vpnAndroidOnlyMessage
source: VPN engine is available on Android only.
hi: VPN इंजिन सिर्फ Android पर उपलब्ध है।

# vpnPermissionRequiredMessage
source: VPN permission is required before protection can start.
hi: सुरक्षा शुरू करने से पहले VPN अनुमति जरूरी है।

# startProtectionHint
source: Start protection to enforce category and domain policies.
hi: श्रेणी और डोमेन नीति लागू करने के लिए सुरक्षा चालू करें।

# protectionChangesHint
source: Protection changes apply immediately. Sync after policy edits.
hi: सुरक्षा बदलाव तुरंत लागू होते हैं। पॉलिसी एडिट के बाद सिंक करें।

# permissionRecoveryTitle
source: Permission Recovery
hi: अनुमति रिकवरी

# vpnPermissionGrantedLabel
source: VPN permission granted
hi: VPN अनुमति मिल गई

# vpnPermissionRequiredLabel
source: Permission required
hi: VPN अनुमति जरूरी

# requestPermissionButton
source: Request Permission
hi: अनुमति मांगें

# requestingButton
source: Requesting...
hi: मांग रहा है...

# vpnSettingsButton
source: VPN Settings
hi: VPN सेटिंग्स

# settingsUpdatedSuccessMessage
source: Settings updated successfully
hi: सेटिंग्स सफलतापूर्वक अपडेट हो गईं

# languageChangedMessage
source: Language changed
hi: भाषा बदल दी गई
